In [411]:
#Import Pandas
import pandas as pd

#Load Resources file
purchase_data = "HeroesOfPymoli/Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(purchase_data)

In [412]:
#show data frame
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [413]:
#get player count
#PLAYER COUNT
player_count = len(purchase_data_df["SN"].unique())
player_count

576

In [414]:
#calculations for Purchasing Analysis (Total)
#number of unique items
unique_items = len(purchase_data_df["Item ID"].unique())
unique_items

179

In [415]:
#calculations:
#average price
average_price = (purchase_data_df["Price"]).mean()
average_price

3.0509871794871795

In [416]:
#calculations:
#number of purchases
number_purchases = len(purchase_data_df["Purchase ID"])
number_purchases

780

In [417]:
#calculations:
#Total sold
total = (purchase_data_df["Price"]).sum()
total

2379.77

In [418]:
#made summary data frame for the calculations
summary_df = pd.DataFrame({"Number of Unique Items": [unique_items], "Average Price": [average_price], 
                           "Number of Purchases": [number_purchases], "Total Revenue": [total]})
summary_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [419]:
#checking types for formatting
summary_df.dtypes

Number of Unique Items      int64
Average Price             float64
Number of Purchases         int64
Total Revenue             float64
dtype: object

In [420]:
#format currency
#PURCHASING ANALYSIS TOTAL SECTION COMPLETE
summary_df["Average Price"] = summary_df["Average Price"].map('${0:,.2f}'.format)
summary_df["Total Revenue"] = summary_df["Total Revenue"].map('${0:,.2f}'.format)
summary_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

In [436]:
#figure out the Gender Demographics
#What gender groups we have - this is *Not* unique, and has duplicates
gender_groups_df = purchase_data_df.groupby(["Gender"])
gender_groups_df.count().head()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [428]:
gender_groups_2_df = gender_groups_df.nunique()["SN"]
gender_groups_2_df

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [429]:
total_gender_groups_2_df = gender_groups_df.sum()["Price"]
total_gender_groups_2_df

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [431]:
percentage_gender_groups_2_df = gender_groups_2_df / player_count *100
percentage_gender_groups_2_df

Gender
Female                   14.062500
Male                     84.027778
Other / Non-Disclosed     1.909722
Name: SN, dtype: float64

In [432]:
gender2_summary_df = pd.DataFrame({"Total Count": gender_groups_2_df, "Percentage of Players": percentage_gender_groups_2_df})
gender2_summary_df

#sort by total

                       Total Count  Percentage of Players
Gender
Female                          81              14.062500
Male                           484              84.027778
Other / Non-Disclosed           11               1.909722

In [438]:
average_total_df = total_2 / gender_groups_2_df
average_total_df

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [408]:
total_2 = gender_groups_2_df["Price"].sum()
total_2

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [166]:
#male demo
male_demo_df = purchase_data_df.loc[purchase_data_df["Gender"] == "Male", :]
male_demo_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [167]:
#female demo
female_demo_df = purchase_data_df.loc[purchase_data_df["Gender"] == "Female", :]
female_demo_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79

In [168]:
#other demo
other_demo_df = purchase_data_df.loc[purchase_data_df["Gender"] == "Other / Non-Disclosed", :]
other_demo_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

In [175]:
#group by SN for unique players 
#males
unique_male_df = male_demo_df.groupby(["SN"])
unique_male_df.count().head()

              Purchase ID  Age  Gender  Item ID  Item Name  Price
SN
Adairialis76            1    1       1        1          1      1
Aeda94                  1    1       1        1          1      1
Aela59                  1    1       1        1          1      1
Aelaria33               1    1       1        1          1      1
Aelastirin39            2    2       2        2          2      2

In [180]:
#count how many unique males
unique_males = len(unique_male_df.count())
unique_males

484

In [182]:
#repeat grouping for females
unique_female_df = female_demo_df.groupby(["SN"])
unique_female_df.count().head()

               Purchase ID  Age  Gender  Item ID  Item Name  Price
SN
Adastirin33              1    1       1        1          1      1
Aerithllora36            2    2       2        2          2      2
Aethedru70               1    1       1        1          1      1
Aidain51                 1    1       1        1          1      1
Aiduesu86                1    1       1        1          1      1

In [183]:
#count how many unique females
unique_females = len(unique_female_df.count())
unique_females

81

In [184]:
#repeat for other 
unique_other_df = other_demo_df.groupby(["SN"])
unique_other_df.count().head()

             Purchase ID  Age  Gender  Item ID  Item Name  Price
SN
Airi27                 1    1       1        1          1      1
Chanosian48            2    2       2        2          2      2
Eodaisu60              1    1       1        1          1      1
Haerithp41             1    1       1        1          1      1
Idairin51              2    2       2        2          2      2

In [185]:
#count how many unique other
unique_others = len(unique_other_df.count())
unique_others

11

In [198]:
#list made of genders
#NOT NEEDED?
gender_list = ["Male", "Female", "Other / Non-Disclosed"]
gender_list

['Male', 'Female', 'Other / Non-Disclosed']

In [199]:
#list made of the total count for each gender
#NOT NEEDED?
total_count_gender = [unique_males, unique_females, unique_others]
total_count_gender

[484, 81, 11]

In [268]:
#find percentages 
#list made for each percentage for each gender
#NOT NEEDED?
percentage_list = []
for gender in total_count_gender:
        percentages = gender / player_count * 100
        percentage_list.append(percentages)
percentage_list

[84.02777777777779, 14.0625, 1.9097222222222223]

In [409]:
#THIS DOESN"T WANT TO WORK,
#CAN IT WORK?
#summary table for gender demo
temp_summary_gender_df = pd.DataFrame({"Gender": gender_list,
                           "Total Count": total_count_gender,
                           "Percentage of Players": percentage_list})
temp_summary_gender_df

                  Gender  Total Count  Percentage of Players
0                   Male          484              84.027778
1                 Female           81              14.062500
2  Other / Non-Disclosed           11               1.909722

In [270]:
#find percentages
#male
male_percent = unique_males / player_count * 100
male_percent

84.02777777777779

In [271]:
#female
female_percent = unique_females / player_count * 100
female_percent

14.0625

In [272]:
#other
other_percent = unique_others / player_count * 100
other_percent

1.9097222222222223

In [280]:
#summary table for gender demo
summary_gender_df = pd.DataFrame({"Gender": ["Male", "Female", "Other / Non-Disclosed"],
                           "Total Count": [unique_males, unique_females, unique_others],
                           "Percentage of Players": [male_percent, female_percent, other_percent]})
summary_gender_df

                  Gender  Total Count  Percentage of Players
0                   Male          484              84.027778
1                 Female           81              14.062500
2  Other / Non-Disclosed           11               1.909722

In [281]:
#format the summary table
#check types first
summary_gender_df.dtypes

Gender                    object
Total Count                int64
Percentage of Players    float64
dtype: object

In [282]:
summary_gender_df.loc[:, "Percentage of Players"] = summary_gender_df["Percentage of Players"].astype("float")
summary_gender_df.dtypes

Gender                    object
Total Count                int64
Percentage of Players    float64
dtype: object

In [283]:
#format percentages
summary_gender_df["Percentage of Players"] = summary_gender_df["Percentage of Players"].map("{:.2f}%".format)
summary_gender_df

                  Gender  Total Count Percentage of Players
0                   Male          484                84.03%
1                 Female           81                14.06%
2  Other / Non-Disclosed           11                 1.91%

In [284]:
#more formatting
#move the Gender to be an index
#GENDER DEMOGRAPHICS SECTION COMPLETE
index_summary_gender_df = summary_gender_df.set_index(["Gender"])
index_summary_gender_df

                       Total Count Percentage of Players
Gender
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%

In [115]:
#calculations for Purchasing Analysis (Gender)
#grouping by gender (non-unique) for calculations
gender_groups_df = purchase_data_df.groupby(["Gender"])
gender_groups_df.count().head()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [124]:
#calculations
#purchase count
purchase_count_gender = gender_groups_df["Price"].count()
purchase_count_gender

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [123]:
#calculations
#average purchase price
average_purchase_gender = gender_groups_df["Price"].mean()
average_purchase_gender

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [122]:
#calculations
#toal purchase value
total_purchase_gender = gender_groups_df["Price"].sum()
total_purchase_gender

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [137]:
#calculations
#average purchase total per person = WHAT = this will need the unique gender information THIS IS THE WRONG INFO******
avg_per_person_gender = gender_groups_df["Price"].mean()
avg_per_person_gender

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [439]:
#"Gender":[gender_types]
#DOESN"T WORK
gender_purchase_df = pd.DataFrame({"Purchase Count": purchase_count_gender,
                                   "Average Purchase Price": average_purchase_gender, 
                                   "Total Purchase Value": total_purchase_gender, 
                                   "Avg Total Purchase per Person": avg_per_person_gender})
gender_purchase_df.head()

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,3.203009
Male,652,3.017853,1967.64,3.017853
Other / Non-Disclosed,15,3.346000,50.19,3.346000

In [286]:
#break up into gender demographics
#female demo use this data set
female_demo_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79

In [325]:
#female calculations
total_female_purchase = len(female_demo_df["SN"])
print(total_female_purchase)
unique_female_purchase = len(female_demo_df["SN"].unique())
print(unique_female_purchase)
female_avg_price = female_demo_df["Price"].mean()
print(female_avg_price)
female_total = female_demo_df["Price"].sum()
print(female_total)
female_avg_person = female_total / unique_female_purchase
print(female_avg_person)

113
81
3.203008849557522
361.94
4.468395061728395

In [326]:
#male demo data us this data set
male_demo_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [330]:
#male calculations
total_male_purchase = len(male_demo_df["SN"])
print(total_male_purchase)
unique_male_purchase = len(male_demo_df["SN"].unique())
print(unique_male_purchase)
male_avg_price = male_demo_df["Price"].mean()
print(male_avg_price)
male_total = male_demo_df["Price"].sum()
print(male_total)
male_avg_person = male_total / unique_male_purchase
print(male_avg_person)

652
484
3.0178527607361967
1967.64
4.065371900826446

In [328]:
#other demo use this data set
other_demo_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

In [329]:
#other calculations
total_other_purchase = len(other_demo_df["SN"])
print(total_other_purchase)
unique_other_purchase = len(other_demo_df["SN"].unique())
print(unique_other_purchase)
other_avg_price = other_demo_df["Price"].mean()
print(other_avg_price)
other_total = other_demo_df["Price"].sum()
print(other_total)
other_avg_person = other_total / unique_other_purchase
print(other_avg_person)

15
11
3.3459999999999996
50.19
4.5627272727272725

In [336]:
#summary data frame for purchasing analysis
summary_purchase_gender_df = pd.DataFrame({"Gender":["Female", "Male", "Other-Non-Disclosed"],
                                           "Purchase Count":[total_female_purchase, total_male_purchase, total_other_purchase],
                                           "Average Purchase Price":[female_avg_price, male_avg_price, other_avg_price],
                                           "Total Purchase Value":[female_total, male_total, other_total],
                                           "Avg Total Purchase per Person":[female_avg_person, male_avg_person, other_avg_person]})
summary_purchase_gender_df

,Gender,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
0,Female,113,3.203009,361.94,4.468395
1,Male,652,3.017853,1967.64,4.065372
2,Other-Non-Disclosed,15,3.346000,50.19,4.562727

In [337]:
#format numbers
summary_purchase_gender_df["Average Purchase Price"] = summary_purchase_gender_df["Average Purchase Price"].map("${:.2f}".format)
summary_purchase_gender_df["Total Purchase Value"] = summary_purchase_gender_df["Total Purchase Value"].map("${:.2f}".format)
summary_purchase_gender_df["Avg Total Purchase per Person"] = summary_purchase_gender_df["Avg Total Purchase per Person"].map("${:.2f}".format)
summary_purchase_gender_df

,Gender,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
0,Female,113,$3.20,$361.94,$4.47
1,Male,652,$3.02,$1967.64,$4.07
2,Other-Non-Disclosed,15,$3.35,$50.19,$4.56

In [445]:
#change index to gender
#PURCHASING ANALYSIS (GENDER) SECTION COMPLETE
index_summary_purchase_gender_df = summary_purchase_gender_df.set_index(["Gender"])
index_summary_purchase_gender_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,$1967.64,$4.07
Other-Non-Disclosed,15,$3.35,$50.19,$4.56

In [ ]:
#MAKE SURE TO GET RID OF DUPLICATES, POTENTIALLY BEFORE MAKING BINS (OR CUTTING FOR THE BINS)

In [442]:
#Age Demographics
#bin ages
bins_ages = [0,9,14,19,24,29,34,39,purchase_data_df["Age"].max()]
group_ages = ["<10", "10-14","15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [443]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [446]:
purchase_data_df["Age Ranges"] = pd.cut(purchase_data_df["Age"], bins_ages, labels=group_ages, include_lowest=False)
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [447]:
age_groups_df = purchase_data_df.groupby(["Age Ranges"])
age_groups_df.count().head(8)

            Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age Ranges
<10                  23   23   23      23       23         23     23
10-14                28   28   28      28       28         28     28
15-19               136  136  136     136      136        136    136
20-24               365  365  365     365      365        365    365
25-29               101  101  101     101      101        101    101
30-34                73   73   73      73       73         73     73
35-39                41   41   41      41       41         41     41
40+                  13   13   13      13       13         13     13

In [377]:
under10_age_demo_df = purchase_data_df.loc[purchase_data_df["Age Ranges"] == "<10", :]
under10_age_demo_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
27,27,Eusri44,7,Male,96,Blood-Forged Skeletal Spine,3.09,<10
33,33,Haillyrgue51,7,Male,44,Bonecarvin Battle Axe,2.38,<10
37,37,Seuthep89,8,Male,73,Ritual Mace,2.05,<10
78,78,Haillyrgue51,7,Male,50,Dawn,4.60,<10
81,81,Heudai45,8,Female,174,Primitive Blade,3.47,<10

In [378]:
under10_total_purchase = len(under10_age_demo_df["SN"])
print(under10_total_purchase)
under10_unique_purchase = len(under10_age_demo_df["SN"].unique())
print(under10_unique_purchase)
under10_avg_price = under10_age_demo_df["Price"].mean()
print(under10_avg_price)
under10_total = under10_age_demo_df["Price"].sum()
print(under10_total)
under10_avg_person = under10_total / under10_unique_purchase
print(under10_avg_person)

23
17
3.353478260869565
77.13
4.537058823529412

In [379]:
#REPEAT FOR ALL AGE & DO SUMMARY TABLE

In [380]:
#Top Spenders - Identify top 5 Players

In [381]:
#Most Popular Items - Identify top 5 most popular items

In [385]:
#Most Profitable Items - Identify top 5 most profitable Items

In [391]:
gender_data = purchase_data_df.groupby(["Gender"])
gender_totals = gender_data["SN"].nunique()
gender_percent = gender_totals/player_count * 100
gender_summary = pd.DataFrame({"Total Count": gender_totals, "Percentage of Players": gender_percent})

gender_summary.index.name = None
gender_summary

                       Total Count  Percentage of Players
Female                          81              14.062500
Male                           484              84.027778
Other / Non-Disclosed           11               1.909722

# FINAL OBSERVATIONS